espressif/esp-gmf/packages/esp_player/test_apps/sdkconfig.defaults.esp32s3
# ESP32-S3 specific defaults for esp_player test
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_ESP_INT_WDT_TIMEOUT_MS=2000
